In [1]:
import pandas as pd

In [49]:
a = pd.Series(data={'bootcamp': 10, 'Thais': 10}, index=['bootcamp', 'Thais', 'Gislaine'])

In [50]:
a

bootcamp    10.0
Thais       10.0
Gislaine     NaN
dtype: float64

In [52]:
a.notna()

bootcamp     True
Thais        True
Gislaine    False
dtype: bool

In [24]:
a = pd.Series(data={'Mariana': 10, 'Thais': 10})
a

Mariana    10
Thais      10
dtype: int64

In [30]:
a[['Mariana', 'Thais']]

Mariana    10
Thais      10
dtype: int64

In [31]:
a['Mariana'] = 200

In [32]:
a

Mariana    200
Thais       10
dtype: int64

In [33]:
'Gislaine' in a

False

In [34]:
'Mariana' in a

True

In [35]:
a

Mariana    200
Thais       10
dtype: int64

In [36]:
a[a > 20]

Mariana    200
dtype: int64

In [37]:
a[a < 20]

Thais    10
dtype: int64

In [40]:
a

Mariana    200
Thais       10
dtype: int64

In [41]:
a*20

Mariana    4000
Thais       200
dtype: int64

In [42]:
a.sum()

210

In [45]:
a**100

Mariana    0
Thais      0
dtype: int64

In [46]:
10**100

10000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000

In [69]:
import numpy as np

In [78]:
a = pd.Series(data={'Thais': 10, 'bootcamp': 10}, index=['Thais', 'bootcamp'])
b = pd.Series(data={'bootcamp': 100}, index=['bootcamp', 'Thais', 'Gislaine'])

In [79]:
a

Thais       10
bootcamp    10
dtype: int64

In [80]:
b

bootcamp    100.0
Thais         NaN
Gislaine      NaN
dtype: float64

In [82]:
c = a+b

In [83]:
c

Gislaine      NaN
Thais         NaN
bootcamp    110.0
dtype: float64

In [84]:
c.index

Index(['Gislaine', 'Thais', 'bootcamp'], dtype='object')

In [85]:
c.index.state = 'nome'

In [86]:
c

Gislaine      NaN
Thais         NaN
bootcamp    110.0
dtype: float64

In [87]:
c.name = 'Exercicio'

In [88]:
c

Gislaine      NaN
Thais         NaN
bootcamp    110.0
Name: Exercicio, dtype: float64

In [89]:
c.drop('bootcamp')

Gislaine   NaN
Thais      NaN
Name: Exercicio, dtype: float64

{0: 1.5, 1: 1.7, 2: 3.6, 3: 2.4, 4: 2.9}

In [103]:
data = {"state": ["Ohio", "Ohio", "Ohio", 
                  "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [91]:
frame.set_index(['state', 'year'])

             pop
state  year
Ohio   2000  1.5
       2001  1.7
       2002  3.6
Nevada 2001  2.4
       2002  2.9
       2003  3.2

In [111]:
d = pd.DataFrame({"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6, 2003: 3.6, 2004: 3.6, 2005: 3.6}, "Nevada": {2001: 2.4, 2010: 2.9, 2005: 3.6, 2003: 3.6, 2004: 3.6}})

In [112]:
d.head(1)

      Ohio  Nevada
2000   1.5     NaN

In [107]:
d.tail(1)

      Ohio  Nevada
2010   NaN     2.9

In [113]:
d.head()

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     NaN
2003   3.6     3.6
2004   3.6     3.6

In [114]:
d.tail()

      Ohio  Nevada
2002   3.6     NaN
2003   3.6     3.6
2004   3.6     3.6
2005   3.6     3.6
2010   NaN     2.9

In [115]:
d

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     NaN
2003   3.6     3.6
2004   3.6     3.6
2005   3.6     3.6
2010   NaN     2.9

In [121]:
d['teste2'] = d['Ohio'] * d['Nevada']

In [122]:
d

      Ohio  Nevada  teste  teste2
2000   1.5     NaN     10     NaN
2001   1.7     2.4     10    4.08
2002   3.6     NaN     10     NaN
2003   3.6     3.6     10   12.96
2004   3.6     3.6     10   12.96
2005   3.6     3.6     10   12.96
2010   NaN     2.9     10     NaN

In [128]:
d['teste'] = range(7)

In [129]:
d

      Ohio  Nevada  teste  teste2
2000   1.5     NaN      0     NaN
2001   1.7     2.4      1    4.08
2002   3.6     NaN      2     NaN
2003   3.6     3.6      3   12.96
2004   3.6     3.6      4   12.96
2005   3.6     3.6      5   12.96
2010   NaN     2.9      6     NaN

In [131]:
del d['teste']

In [132]:
d

      Ohio  Nevada  teste2
2000   1.5     NaN     NaN
2001   1.7     2.4    4.08
2002   3.6     NaN     NaN
2003   3.6     3.6   12.96
2004   3.6     3.6   12.96
2005   3.6     3.6   12.96
2010   NaN     2.9     NaN

In [136]:
type(d.values)

numpy.ndarray

In [143]:
d = d.drop(columns=['Ohio'])

In [145]:
d

      Nevada  teste2
2000     NaN     NaN
2001     2.4    4.08
2002     NaN     NaN
2003     3.6   12.96
2004     3.6   12.96
2005     3.6   12.96
2010     2.9     NaN

In [167]:
d = d.rename(columns={'teste2': 'NovaColuna'}, index={2010:2006})
d

In [168]:
d

      Nevada  NovaColuna
2000     NaN         NaN
2001     2.4        4.08
2002     NaN         NaN
2003     3.6       12.96
2004     3.6       12.96
2005     3.6       12.96
2006     2.9         NaN

In [169]:
d.isna()

      Nevada  NovaColuna
2000    True        True
2001   False       False
2002    True        True
2003   False       False
2004   False       False
2005   False       False
2006   False        True

In [165]:
np.nan

nan

In [166]:
pd.na

AttributeError: module 'pandas' has no attribute 'na'

In [170]:
from numpy import nan
df = pd.DataFrame([[1.4, nan], [7.1, -4.5], 
                   [nan, nan], [0.75, -1.3]], \
                  index=["a", "b", "c", "d"], \
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [171]:
df['three'] = np.nan

In [172]:
df

    one  two  three
a  1.40  NaN    NaN
b  7.10 -4.5    NaN
c   NaN  NaN    NaN
d  0.75 -1.3    NaN

In [189]:
df.sum(axis='rows', skipna=False)

one     NaN
two     NaN
three   NaN
dtype: float64

In [190]:
df.sum(axis='rows', skipna=True)

one      9.25
two     -5.80
three    0.00
dtype: float64

In [191]:
df.mean(axis='rows', skipna=False)

one     NaN
two     NaN
three   NaN
dtype: float64

In [192]:
df.mean(axis='rows', skipna=True)

one      3.083333
two     -2.900000
three         NaN
dtype: float64

In [197]:



df.idxmax()

/var/folders/3k/5x2j3hkx6x3f717k3344mgpm0000gn/T/ipykernel_80813/607551610.py:1: FutureWarning: The behavior of DataFrame.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.idxmax()

one        b
two        d
three    NaN
dtype: object

In [199]:
df

    one  two  three
a  1.40  NaN    NaN
b  7.10 -4.5    NaN
c   NaN  NaN    NaN
d  0.75 -1.3    NaN

In [198]:
df.cumsum()

    one  two  three
a  1.40  NaN    NaN
b  8.50 -4.5    NaN
c   NaN  NaN    NaN
d  9.25 -5.8    NaN

In [211]:
df['teste'] = 'no sei'
df.iloc[0, 3] = 5

In [212]:
df

    one  two  three    teste
a  1.40  NaN    NaN        5
b  7.10 -4.5    NaN  no sei
c   NaN  NaN    NaN  no sei
d  0.75 -1.3    NaN  no sei

In [213]:
df.describe()

            one       two  three
count  3.000000  2.000000    0.0
mean   3.083333 -2.900000    NaN
std    3.493685  2.262742    NaN
min    0.750000 -4.500000    NaN
25%    1.075000 -3.700000    NaN
50%    1.400000 -2.900000    NaN
75%    4.250000 -2.100000    NaN
max    7.100000 -1.300000    NaN

In [215]:
df['teste'].describe()

count           4
unique          2
top       no sei
freq            3
Name: teste, dtype: object